euicc-efs-container/target/classes/WebServicesAPI/ES1_SMSR.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<wsdl:definitions targetNamespace="http://namespaces.gsma.org/esim-messaging/3"
    xmlns:rps="http://namespaces.gsma.org/esim-messaging/3"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsa="http://www.w3.org/2005/08/addressing"
    xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
    xmlns:wsoap12="http://schemas.xmlsoap.org/wsdl/soap12/"
    xmlns:xs="http://www.w3.org/2001/XMLSchema">
 
    
<!-- WSDL TYPES -->
    <wsdl:types>
        <xs:schema targetNamespace="http://namespaces.gsma.org/esim-messaging/3" elementFormDefault="qualified" >
            <xs:include schemaLocation="xsd/euicc.request.ES1.xsd"/>
        </xs:schema>
		<xs:schema targetNamespace="http://www.w3.org/2005/08/addressing" elementFormDefault="qualified" >
            <xs:include schemaLocation="xsd/import/ws-addr.xsd"/>
        </xs:schema>
    </wsdl:types>

 <!-- WSA MESSAGES -->
    <wsdl:message name="SoapHeader">
        <!-- WSA MANDATORY -->
        <wsdl:part name="From" element="wsa:From"/>
        <wsdl:part name="To" element="wsa:To"/>
        <wsdl:part name="Action" element="wsa:Action"/>
        <wsdl:part name="MessageID" element="wsa:MessageID"/>
        <wsdl:part name="RelatesTo" element="wsa:RelatesTo"/>
        <!-- WSA OPTIONAL -->
        <wsdl:part name="ReplyTo" element="wsa:ReplyTo"/>      
    </wsdl:message>
    
<!-- ES1 MESSAGES --> 
    <wsdl:message name="ES1-RegisterEISRequestMessage">
        <wsdl:part name="parameters" element="rps:ES1-RegisterEISRequest"/>
    </wsdl:message>
    <wsdl:message name="ES1-RegisterEISResponseMessage">
        <wsdl:part name="parameters" element="rps:ES1-RegisterEISResponse"/>
    </wsdl:message>
    
<!-- SOAP PORT OPERATIONS -->
    <wsdl:portType name="ES1SmSr">
        <wsdl:operation name="ES1-RegisterEIS">
            <wsdl:input message="rps:ES1-RegisterEISRequestMessage"
                wsa:Action="http://gsma.com/ES1/eUICCManagement/ES1-RegisterEISRequest"
                wsam:Action="http://gsma.com/ES1/eUICCManagement/ES1-RegisterEISRequest"/>
            <wsdl:output message="rps:ES1-RegisterEISResponseMessage"
                wsa:Action="http://gsma.com/ES1/eUICCManagement/ES1-RegisterEISResponse"
                wsam:Action="http://gsma.com/ES1/eUICCManagement/ES1-RegisterEISResponse"/>
        </wsdl:operation>
    </wsdl:portType>

 <!-- SOAP BINDING -->
    <wsdl:binding name="ES1SmSrServiceBinding" type="rps:ES1SmSr">
        <wsoap12:binding transport="http://www.w3.org/2003/05/soap/bindings/HTTP/" style="document"/>
        <wsdl:operation name="ES1-RegisterEIS">
            <wsoap12:operation style="document"/>
            <wsdl:input>
                <wsoap12:header message="rps:SoapHeader" use="literal" part="From" wsdl:required="true"/>
                <wsoap12:header message="rps:SoapHeader" use="literal" part="To" wsdl:required="true"/>
                <wsoap12:header message="rps:SoapHeader" use="literal" part="MessageID" wsdl:required="true"/>
                <wsoap12:header message="rps:SoapHeader" use="literal" part="Action" wsdl:required="true"/>
                <wsoap12:body use="literal" wsdl:required="true"/>
            </wsdl:input>
            <wsdl:output>
                <wsoap12:header message="rps:SoapHeader" use="literal" part="From" wsdl:required="true"/>
                <wsoap12:header message="rps:SoapHeader" use="literal" part="To" wsdl:required="true"/>
                <wsoap12:header message="rps:SoapHeader" use="literal" part="MessageID" wsdl:required="true"/>
                <wsoap12:header message="rps:SoapHeader" use="literal" part="Action" wsdl:required="true"/>
                <wsoap12:header message="rps:SoapHeader" use="literal" part="RelatesTo" wsdl:required="true"/>
                <wsoap12:body use="literal" wsdl:required="true"/>
            </wsdl:output>
        </wsdl:operation>  
    </wsdl:binding>

<!-- SOAP SERVICE -->
    <wsdl:service name="ES1SmSrService">
        <wsdl:port binding="rps:ES1SmSrServiceBinding" name="SmSrES1Port">
            <wsoap12:address location="http://gsma.org/esim-messaging/3/ES1/ES1SmSrService"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>